Revit 2026 API

# AirHeatingCoilType Enumeration

---

The type of air heating coil.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AirHeatingCoilType
```
```vb
Public Enumeration AirHeatingCoilType
```
```cpp
public enum class AirHeatingCoilType
```
```fsharp
type AirHeatingCoilType
```

| Member name | Value | Description |
| --- | --- | --- |
| ElectricResistance | 1 |  |
| Furnace | 2 |  |
| HotWater | 3 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace